{"sourceurl": "http://www.breitbart.com/big-government/", "sourcename": "breitbart", "response_body": "A number of ex-Obama officials appear to suggest that the Obama administration may have actually wiretapped the Trump campaign, but that if they did it would have been justified by a court and part of an investigation by the Justice Department—not led by or ordered from the White House or the former president himself.", "date": null, "title": "Big Government Articles"}
{"sourceurl": "http://www.breitbart.com/big-government/2017/03/03/survey-solid-majority-trump-refugee-reform/", "sourcename": "breitbart", "response_body": "SIGN UP FOR OUR NEWSLETTER\n\nNo matter how the poll questions are asked, a clear majority of Americans support President Donald Trump’s January reform of the nation’s refugee policies, says a large new survey of 22,000 people.\n\n“Overall, 54 percent of registered voters approved of the [Jan. 25 refugee] executive order and 40 percent disapproved … Six percent did not have an opinion either way,” according to the February survey by Morning Consult.\n\nSIGN UP FOR OUR NEWSLETTER\n\nThe survey asked slightly different questions to subgroups within the huge survey. But public opinion barely budged when different terms were used, Morning Consult said;\n\nThere was no difference in results when respondents saw the word banning (53 approve, 40 disapprove) versus blocking (54 approve, 40 disapprove). Nor was there a difference in responses when blocking/banning with no time limit (54 approve, 40 disapprove), the word ‘temporary’ (53 approve, 41 disapprove) or the phrase “for 90 days” (54 approve, 40 disapprove) is used.\n\nLeft-wing judges in California have blocked parts of Trump’s order, which temporarily barred inflow of refugees from seven conflict-wracked Muslim countries, halved the annual inflow of refugees to 55,000 and declared formal opposition to the acceptance of would-be immigrants who have “hostile attitudes.” Trump is expected to sign a new order in the next few days to evade the judicial ban.\n\nIslamic groups and progressives oppose what they describe as Trump’s “Muslim ban” or his “travel ban,” but Trump is expected to sign a new order in the next few days to evade the judicial ban.\n\nThe policy is strongly supported by Trump’s base, the survey showed.\n\nApproval was 20 percentage points higher among seniors (58 percent) than among adults under 30 years old (39 percent). Republicans (85 percent) were three times as likely to approve as Democrats (29 percent), and men (59 percent) were 10 percentage points more likely to approve than women (49 percent).\n\nThe largest differences in responses came when the pollsters changed how the would-be migrants were described:\n\nSupport for the ban is 4 percentage points higher, 55 percent approve vs. 51 percent approve, when the population is described as “people” rather than “people, including U.S. lawful permanent residents and visa holders originally.\n\nThe survey showed overall strong approval of 34 percent and strong opposition of 30 percent. Somewhat approval was 19 percent and somewhat disapproval was 11 percent, with 6 percent declining to pick a side.\n\nMultiple other polls show broad and stable public support for the president’s policy, despite lopsided opposition among Democrats, progressives and media outlets.", "date": "2017-03-03 00:00:00", "title": "Big Survey Shows Firm Majority Support for Donald Trump’s Refugee Reform"}
{"sourceurl": "http://www.breitbart.com/big-government/2017/03/03/state-department-sponsored-sessions-meeting-with-russian-ambassador/", "sourcename": "breitbart", "response_body": "SIGN UP FOR OUR NEWSLETTER\n\nPresident Barack Obama’s Department of State sponsored the July event in Ohio where Sen. Jeff Sessions met the Russian ambassador for the second time in 2016, according to the organizers of the event.\n\nThe July 20 meeting in Cleveland was used by the Washington Post’s March 1 headline to double the number of meetings where Sessions met with Russians in 2016. “Sessions met with Russian envoy twice last year, encounters he later did not disclose,” said the headline, which has created a mini-scandal as Democratic partisans push for Sessions’ resignation from his post as the nation’s Attorney General, amid Democratic claims that the Russian government helped Donald Trump win the 2016 election.\n\nSIGN UP FOR OUR NEWSLETTER\n\nThe two-day event was hosted by a civic organization, Global Cleveland, whose website cites the state department’s role:\n\nOn Tuesday, July 19, Global Cleveland welcomed roughly 80 international ambassadors to its Global Partners in Diplomacy reception at Severance Hall. The event, coordinated in partnership with the 2016 Republican National Convention and the U.S. Department of State, introduced the ambassadors to nearly 200 of Northeast Ohio’s civic and corporate leaders. …. The [first] evening’s keynote speaker, U.S. Senator Bob Corker, chairman of the Senate Committee on Foreign Relations, stressed the importance of understanding what “having people of different backgrounds and origins means to your community.” … Click here to see pictures from the event: https://www.facebook.com/GlobalCleveland/photos/?tab=album&album_id=1105759579497225\n\nThe July 19 activities were covered by Cleveland.com, which quotes one of the organizers saying “We are working very closely with the State Department and the RNC to make sure folks coming to Cleveland are filled in with everything they need to know about, including that Cleveland is awesome.”\n\nThe revelation of the State Department’s role in arranging Sessions’ brief meeting with the Russian ambassador comes as news reports sketch out a large effort by deputies working for outgoing President Barack Obama to track and disseminate information about Donald Trump and his deputies.\n\nThe Washington Post article used the Ohio event to justify its front-page claim that Sessions held “meetings” with the Russian ambassador, Sergei Kisylak. According to the article’s lede:\n\nThen-Sen. Jeff Sessions (R-Ala.) spoke twice last year with Russia’s ambassador to the United States, Justice Department officials said, encounters he did not disclose when asked about possible contacts between members of President Trump’s campaign and representatives of Moscow during Sessions’s confirmation hearing to become attorney general… The previously undisclosed discussions could fuel new congressional calls for the appointment of a special counsel to investigate Russia’s alleged role in the 2016 presidential election.\n\nBut the Washington Post only briefly described the Ohio meeting in the 32nd and 33rd paragraphs of the story, saying:\n\nTwo months before the September meeting, Sessions attended a Heritage Foundation event in July on the sidelines of the Republican National Convention that was attended by about 50 ambassadors. When the event was over, a small group of ambassadors approached Sessions as he was leaving the podium, and Kislyak was among them, the Justice Department official said. Sessions then spoke individually to some of the ambassadors, including Kislyak, the official said. In the informal exchanges, the ambassadors expressed appreciation for his remarks and some of them invited him to events they were sponsoring, said the official, citing a former Sessions staffer who was at the event.\n\nSessions said he also met the Russian ambassador in September, with two of his senior staff. The meeting became “testy” when the subject of Ukraine was broached, he said at a March 2 press conference.", "date": "2017-03-03 00:00:00", "title": "Obama’s State Department Sponsored 2016 Meeting of Russian Ambassador with Sen. Sessions"}
{"sourceurl": "http://www.breitbart.com/big-government/2017/03/04/donald-trump-questions-sick-guy-barack-obama-wire-tapping-campaign/", "sourcename": "breitbart", "response_body": "SIGN UP FOR OUR NEWSLETTER\n\nPresident Donald Trump accused former President Barack Obama of wiretapping his campaign headquarters during the election in a series of messages on Twitter.\n\n“Terrible! Just found out that Obama had my ‘wires tapped’ in Trump Tower just before the victory,” he wrote on Twitter. “Nothing found. This is McCarthyism!”\n\nSIGN UP FOR OUR NEWSLETTER\n\nTrump questioned whether it was legal for Obama to be wiretapping a presidential candidate while he was still in office.\n\n“How low has President Obama gone to tapp (sic) my phones during the very sacred election process,” he wrote. “This is Nixon/Watergate. Bad (or sick) guy! Is it legal for a sitting President to be ‘wire tapping’ a race for president prior to an election? Turned down by court earlier. A NEW LOW!”\n\nTrump is likely referring to calls from talk radio hosts Mark Levin and Rush Limbaugh to investigate the nature of the Obama administration’s investigations of his campaign aides for their communications with Russia, as Breitbart News editor Joel Pollak reported.\n\nAs former Heat Street editor Louise Mensch reported the day before the election, “sources with links to the counter-intelligence community” confirmed that a FISA court had granted a FISA court warrant in October to monitor activities in Trump tower. They were previously denied a request in June, according to the report as well as a report in the Guardian.\n\nThe New York Times reported on Wednesday that the Obama team classified the investigation at the lowest possible level, allowing the data gathered from the investigation to be shared and leaked widely within the administration.\n\nIn January, The New York Times reported that intelligence reports based on some of the wiretapped communications had been provided to the Obama White House even though there was “no conclusive evidence of wrongdoing” between Russian officials and associates of Trump.\n\nOn Twitter, Trump suggested that he might even have legal options against the former president.\n\n“I’d bet a good lawyer could make a great case out of the fact that President Obama was tapping my phones in October, just prior to Election!” he wrote.", "date": "2017-03-04 00:00:00", "title": "Donald Trump Questions ‘Sick Guy’ Barack Obama for ‘Wire Tapping’ His Campaign"}
{"sourceurl": "http://www.breitbart.com/big-government/2017/03/04/five-clinton-russia-bombshells-progressives-yawned-over/", "sourcename": "breitbart", "response_body": "SIGN UP FOR OUR NEWSLETTER\n\nGiven the establishment media’s focus on the “scandal” surrounding President Donald Trump and his administration’s contact with Russian officials, it is worth reminding Americans of the revelations involving Hillary Clinton and the Kremlin.\n\n1. Hillary Clinton approved the transfer of 20 percent of U.S. uranium to Russia and nine investors in the deal funneled $145 million to the Clinton Foundation.\n\nSIGN UP FOR OUR NEWSLETTER\n\nWhile Hillary Clinton’s State Department was one of eight agencies to review and sign off on the transfer of 20 percent of U.S. uranium to Russia — then-Secretary of State Clinton herself was the only agency head whose family foundation received $145 million in donations from multiple people connected to the uranium deal, as reported by the New York Times.\n\n2. Bill Clinton bagged $500,000 for a Moscow speech paid for by a Kremlin-backed bank while Hillary Clinton was Secretary of State.\n\nFormer President Bill Clinton delivered a speech in Moscow and received a $500,000 speaking fee from a Russian government-connected bank, while his wife’s State Department was getting ready to sign off on the transfer of 20 percent of U.S. uranium to Russia.\n\n“And, in one case, a Russian investment bank connected to the deals paid money to Bill Clinton personally, through a half-million-dollar speaker’s fee,” reported the New Yorker.\n\n3. Hillary Clinton’s campaign chairman’s Joule energy company bagged $35 million from Putin’s Rusnano.\n\nHillary Clinton’s campaign chairman John Podesta sat on the executive board of an energy company, Joule Unlimited, which received millions from a Putin-connected Russian government fund. Podesta also owned “75,000 common shares” in Joule Unlimited, which he had transferred to a holding company called Leonidio LLC.\n\nPodesta also failed to fully disclose his position on Joule Unlimited’s board of directors and include it in his federal financial disclosures, as required by law, before he became President Obama’s senior adviser in January 2014.\n\n4. Clinton Foundation chatter with State Dept. on Uranium Deal with Russia.\n\nSenior staffers inside Hillary Clinton’s presidential campaign were warned by Clinton Foundation senior vice president Maura Pally that the chairman of the Senate Judiciary Committee, Sen. Charles Grassley (R-IA), was asking the Department of Justice to investigate the State Department approval of the sale of American uranium assets to a Russian company.\n\nThe chain of emails proved the regular interaction between members of the Clinton campaign and senior staff at the Clinton Foundation.\n\n5. Hillary Clinton hid $2.35 million in secret donations from Ian Telfer, the head of Russia’s uranium company.\n\nIan Telfer, the head of the Russian government’s uranium company, Uranium One, made four foreign donations totaling $2.35 million to the Clinton Foundation, as the New York Times reported.\n\n“Uranium One’s chairman used his family foundation to make four donations totaling $2.35 million,” the Times reported. “Those contributions were not publicly disclosed by the Clintons, despite an agreement Mrs. Clinton had struck with the Obama White House to publicly identify all donors. Other people with ties to the company made donations as well.”\n\nFollow Jerome Hudson on Twitter @jeromeehudson.", "date": "2017-03-04 00:00:00", "title": "Five Clinton-Russia Bombshells Progressives Yawned Over"}
{"sourceurl": "http://www.breitbart.com/big-government/2017/03/04/delingpole-why-trump-should-quit-the-dangerous-and-immoral-united-nations-international-treaty-on-climate-change/", "sourcename": "breitbart", "response_body": "SIGN UP FOR OUR NEWSLETTER\n\nRight now, President Trump faces a terrible dilemma on climate change and the UN.\n\nShould he:\n\nSIGN UP FOR OUR NEWSLETTER\n\na) follow the example of his predecessors — the Bushes, Clinton, and Obama — and take the dumb, cowardly, economically damaging, scientifically illiterate and totally wrong decision?\n\nor\n\nb) stay true to his campaign promises and do the right thing by America, by honest science, and by the whole world?\n\nPersonally, I would have thought it was a no-brainer.\n\nBut not, apparently. The New York Times is urging President Trump to ignore the facts and the evidence, and instead listen to the siren voices of his daughter Ivanka, his Secretary of State Rex Tillerson and the various assorted members of the Climate Industrial Complex who would prefer the U.S. to remain shackled to one of the most stupid and pointless agreements in American history.\n\nThey want him to keep the U.S. stuck in the disastrous and ill-advised United Nations Framework Convention on Climate Change (UNFCCC).\n\nAt least George H.W. Bush, who nodded through the deal at the 1992 Rio Earth Summit, had the excuse that he was going with the flow of the popular mood and acting in accordance with the known science of the time.\n\nBut that was 25 years ago, when Taylor Swift was three, Justin Bieber was still in the womb, and no one had ever heard of twerking, virtue-signalling, Grand Theft Auto, Breaking Bad, the Second Gulf War, Islamic State or Amy Schumer’s comedy vagina — since when, an awful lot has changed.\n\nOne of the big things that has changed with regard to the UNFCCC agreement is that anyone who has done any background reading on the subject now knows that it is based on a pack of lies, junk science and barely concealed left-wing political activism.\n\nThe distinguished physicist Dr. Richard Lindzen recently set out the case well in an open letter to the president, signed by more than 300 eminent scientists and other qualified individuals:", "date": "2017-03-04 00:00:00", "title": "DELINGPOLE: Why Trump Should Quit the Dangerous and Immoral UNFCCC"}
{"sourceurl": "http://www.breitbart.com/big-government/2017/03/04/anti-racism-preschool-open-seattle/", "sourcename": "breitbart", "response_body": "SIGN UP FOR OUR NEWSLETTER\n\nTwo teachers are planning to open a preschool in Columbia City in Seattle, Washington, that will have a curriculum focused on the stories of people of color.\n\nAccording to NBC affiliate King5, the two teachers have already been holding a series of community workshops focused on the experiences of people of color, but they want to expand the discussion of race and racism to an entire preschool curriculum.\n\nSIGN UP FOR OUR NEWSLETTER\n\n“We’re looking to create the confidence that when these kids go into predominately white schools that they can bring counter narratives to the school,” said Benjamin Gore, who, with Jasen Frelot, plans to open the preschool in the fall of this year at Columbia City Church of Hope.\n\n“When we’re telling stories to our kids, especially about people of color, we want to make sure that we’re showing them stories about people of color that aren’t just about people existing in the past,” said Frelot.\n\n“I like the idea of these kids being exposed to role models that don’t look like them,” parent Taryn Coe reportedly said. “And there’s a lot of Disney princess culture that happens in our house, and they see white princesses and say, ‘I want to look like that,’ and I think it’s really important that they see there are so many other ways they can accomplish things than being a white princess.”\n\nColumbia City Church of Hope calls itself a “progressive community of faith.”\n\n“We are creating a radically inclusive space where everyone can be real,” the church’s website states. “We work for justice, especially for those who are systematically denied it: people experiencing homelessness, those who identify as LGBT, People of Color, those who are economically marginalized.”", "date": "2017-03-04 00:00:00", "title": "‘Anti-Racism’ Preschool to Open in Seattle"}
{"sourceurl": "http://www.breitbart.com/big-government/2017/03/04/breitbart-news-john-carney-vs-cnn-brian-stelter-americans-panic-donald-trump/", "sourcename": "breitbart", "response_body": "SIGN UP FOR OUR NEWSLETTER\n\nBreitbart News reporter John Carney joined a panel of six establishment media journalists at the Columbia Journalism School to discuss the media’s role covering the Trump administration, including CNN’s media reporter Brian Stelter.\n\nStelter appeared aghast after Carney suggested that there was no reason for reporters to “panic” at the idea of a Donald Trump presidency.\n\nSIGN UP FOR OUR NEWSLETTER\n\n“I think that this is the best beginning of a presidency that I have experienced in my adult life,” Carney said, pointing out that Trump was delivering on his campaign promises.\n\nAs an example, Carney pointed out that despite what cable news channels reported about Trump softening his position on immigration, he repeated his promise during his joint speech to Congress earlier in the week.\n\n“There’s not going to be a real wall,” Stelter protested.\n\n“This is what people say all the time,” Carney replied. “I believe there will be a real giant wall, and maybe it just got ten feet higher because he might have heard you say that.”\n\nNew York Times Washington Bureau Chief Elisabeth Bumiller boasted that they were increasing their staff of journalists in Washington D.C. to hold the administration accountable.\n\n“I think it’s extraordinary that the press sort of ‘woke up’ after Donald Trump’s election to a moment of clarity about its job,” Carney replied. “I think that is one of the things that actually people find alienating.”\n\nCarney suggested that Trump’s worldview was fundamentally opposed to by many journalists who were tasked with covering the administration.\n\n“They can’t hear the word or phrase ‘economic nationalism’ without thinking that is bad. They come from, I would say, a globalist secularist point of view and the idea of a president who uses the phrase ‘America First’ strikes them as disturbing,” he said.\n\nTurning to the New York Times editor, Carney asked, “Do you think you have enough people who understand and sympathize with Trump’s worldview in your news organizations or do you think that you are predominantly staffed by people who view Trump’s view as not just wrong but probably also evil?”\n\nBumiller shot back, “Do you have enough people in your news organization who disagree with Trump’s point of view?”\n\nDuring the panel, Carney explained why he moved to Breitbart News from the Wall Street Journal.\n\n“Breitbart is the most innovative and exciting source of journalism in America today,” he replied, referring to the familiar “entrepreneurial spirit” at Breitbart that he experienced when he helped create Business Insider.", "date": "2017-03-04 00:00:00", "title": "Breitbart News’ John Carney vs CNN’s Brian Stelter: Should Americans Panic over Donald Trump?"}
{"sourceurl": "http://www.breitbart.com/big-government/2017/03/04/two-house-republicans-join-democratic-effort-demanding-trump-release-tax-returns/", "sourcename": "breitbart", "response_body": "SIGN UP FOR OUR NEWSLETTER\n\nTwo Republican congressmen are supporting an attempt by Democrats to force the House and Senate committees responsible for internal revenue to request that President Trump releases his tax returns.\n\nReps. Mark Sanford (R-SC) and Walter Jones (R-NC) signed a letter written by Rep. Bill Pascrell (D-NJ), and signed by the majority of the Democratic caucus, urging the chairmen of the House Ways and Means Committee and Senate Finance Committee to demand a copy of Trump’s tax returns dating back to 2007.\n\nSIGN UP FOR OUR NEWSLETTER\n\n“We believe the powerful and respected Committees on Finance and Ways and Means have the responsibility to ensure oversight of the executive branch by requesting a review of President Trump’s tax returns and moving toward a formal release of these documents to the public,” the letter reads.\n\nHowever, the letter is unlikely to be successful given that the chairmen of both committees have previously ruled out demanding the tax returns. Senate Finance Committee Chairman Orrin Hatch (R-UT) said that the priority of Congress was to “fix America’s broken tax code – not to target the tax returns of individual citizens.”\n\nMeanwhile, House Ways and Means Committee Chairman Kevin Brady (R-TX) cited privacy concerns, arguing that “if Congress begins to use its powers to rummage around in the tax returns of a president, what prevents Congress from doing the same to average Americans.”\n\nPresident Trump has consistently rejected calls to release tax returns, with his former campaign manager Kellyanne Conway telling ABC in January “that President Trump and his family are complying with all the ethical rules, everything they need to do to step away from his businesses. and be a full-time president.”\n\nYou can follow Ben Kew on Facebook, on Twitter at @ben_kew, or email him at bkew@breitbart.com", "date": "2017-03-04 00:00:00", "title": "Two House Republicans Join Democratic Effort Demanding Trump Release Tax Returns"}
{"sourceurl": "http://www.breitbart.com/big-government/2017/03/04/tancredo-on-sessions-flap-democrats-ferocious-malevolence-matched-by-congressional-republicans-cowardice/", "sourcename": "breitbart", "response_body": "SIGN UP FOR OUR NEWSLETTER\n\nThis week we are reminded of that old political axiom– “I can handle my enemies, but please, God, protect me from my friends.”\n\nA handful of Republicans in Congress joined the concerted attack by Democrat leaders in criticizing Attorney General Jeff Sessions for not answering a question that was never asked in his confirmation hearing.\n\nSIGN UP FOR OUR NEWSLETTER\n\nAs part of his confirmation hearing in a Senate committee, Sessions was asked by Sen. Al Franken about meetings with “foreigners” while serving as a surrogate for candidate Trump during the 2016 presidential campaign. Sessions replied that he had no such meetings while assisting the Trump campaign.\n\nThe Washington Post summarized the confirmation hearing encounter this way in its March 1 story:\n\nAt his Jan. 10 Judiciary Committee confirmation hearing, Sessions was asked by Sen. Al Franken (D-Minn.) what he would do if he learned of any evidence that anyone affiliated with the Trump campaign communicated with the Russian government in the course of the 2016 campaign. “I’m not aware of any of those activities,” he responded. He added: “I have been called a surrogate at a time or two in that campaign and I did not have communications with the Russians.”\n\nLater, after the Senate committee hearing, a member of the committee, Sen. Patrick J. Leahy (D-Vt.), asked Sessions for answers to written questions. One question was this one: “Several of the President-elect’s nominees or senior advisers have Russian ties. Have you been in contact with anyone connected to any part of the Russian government about the 2016 election, either before or after election day?” Leahy wrote. Sessions responded with one word: “No.”\n\nThe important thing here is that both answers were truthful: Sessions answered the questions that were asked, not questions that were not asked. Leahy asked about conversations “about the 2016 election.” Sessions replied that, no, he had no such conversations with Russian officials. Senator Sessions’ meeting with the Russian Ambassador in his Senate office had nothing to do with the 2016 campaign and was not unlike meetings held with the Russian Ambassador by many Democrat senators during the year.\n\nOh, and by the way, President Obama met with the Russian Ambassador in the White House 22 times during his presidency.\n\nBut truthful answers by Sen. Sessions are not good enough for Senate and House Democrats– and not good enough for a small handful of House Republicans like Colorado’s Mike Coffman. Those Republican members of Congress should be ashamed, and their constituents back home should be planning their 2018 replacements.\n\nCongressman Coffman distanced himself from candidate Trump in the last days of the 2016 campaign, and his criticism of Trump’s Attorney General this week fits a pattern of self-serving comments critical of Trump, his appointees, and his policies.\n\nCoffman went further than a mild rebuke of Sessions. He told a CBS news reporter in Denver that Sen. Sessions “made a grave omission” in his Senate testimony by not volunteering information about his meeting in his Senate office with the Russian Ambassador.\n\nCoffman then went even further in this statement: “I would encourage him to fully disclose any and all foreign contacts he had during the course of the campaign.”\n\nThis latter statement basically calls Attorney General a liar by suggesting he is hiding something.\n\nThis attack by innuendo is unforgivable for a Republican congressman because it straight out of the Democrats’ anti-Trump playbook aimed at promoting the Big Lie that the Russians, not the American people, elected Trump.\n\nSuch slander-by-innuendo is part of the Soros-funded “Deep State” strategy to undermine the legitimacy of the 2016 election results. It is quite a stretch in both fact and logic to suggest that any conversation with any Russian official, including the Russian Ambassador, during calendar year 2016 must have been part of a conspiracy to control the outcome of the election– a conspiracy for which no evidence whatsoever exists!\n\nAnd yet, despite the obvious partisan motivations behind this slanderous campaign against the President, we see some Republican members of Congress Like Coffman supporting that Soros game plan through cheap shots to generate self-serving media coverage.\n\nThe mainstream media is engaged in a witch hunt that makes the Salem witch trials of the 17th Century look like a Disneyland vacation. And yet, despite the ferocity of the campaign, they have yet to discover even one scintilla of evidence for any Trump campaign collusion with Russian hackers or Russian operatives.\n\nThey won’t ever discover any evidence for one simple reason: it never happened. It is a fictional story invented to explain how virtuous Princess Hillary lost the election to a man beloved only by the “deplorables.”\n\nWe can expect this kind of frenzied with hunt from leftist mobs and progressive politicians who have suddenly lost control of the levers of power in Washington, D.C. What we should not expect– and should not tolerate– is traitorous collusion with the lynch mob by Republicans — whether they come from Red states, blue states or purple states.", "date": "2017-03-04 00:00:00", "title": "Tancredo on Sessions Flap: Democrats’ Ferocious Malevolence Matched by Congressional Republicans’ Cowardice"}
{"sourceurl": "http://www.breitbart.com/big-government/2017/03/04/non-denial-denial-obama-response-trump-wiretap-claim-raises-questions/", "sourcename": "breitbart", "response_body": "SIGN UP FOR OUR NEWSLETTER\n\nA number of ex-Obama officials appear to suggest that the Obama administration may have actually wiretapped the Trump campaign, but that if they did it would have been justified by a court and part of an investigation by the Justice Department—not led by or ordered from the White House or the former president himself.\n\nOn Saturday, former President Obama’s spokesman Kevin Lewis denied that the former White House or the former President himself would have given such an order to wiretap Trump Tower—or any other type of surveillance in any case—but that such an order would have come from an “independent investigation led by the Department of Justice.”\n\nSIGN UP FOR OUR NEWSLETTER\n\n“A cardinal rule of the Obama Administration was that no White House official ever interfered with any independent investigation led by the Department of Justice,” Lewis said. “As part of that practice, neither President Obama nor any White House official ever ordered surveillance on any U.S. citizen. Any suggestion otherwise is simply false.”\n\nLewis’ statement on the former president’s behalf came in response to the explosive charges from President Donald Trump, who tweeted on Saturday morning that the Obama team conducted surveillance on Trump Tower during the campaign and afterward.\n\nValerie Jarrett, another close Obama aide, also tweeted the statement from former President Obama’s spokesman, Lewis. Jarrett is, according to the U.K. Daily Mail, now living in the Obamas’ multimillion dollar Washington, D.C. mansion. From there, the Daily Mail reports, the former president and Jarrett will be running a “nerve center for their plan to mastermind the insurgency against President Trump.”\n\nCheck out statement from Kevin Lewis, spokesperson to former President Obama. Enough said. pic.twitter.com/OTEQiVOHvh — Valerie Jarrett (@ValerieJarrett) March 4, 2017\n\nInterestingly, however, a number of other former Obama administration officials do not deny that such a wiretap existed. They just deny that the White House or Obama himself would have approved it or ordered it, and say that the Department of Justice would have sought it in consultation with a foreign intelligence surveillance, or FISA, court.\n\nObama’s former speechwriter Jon Favreau tweeted that he would warn reporters against saying there was no wiretap.\n\nI'd be careful about reporting that Obama said there was no wiretapping. Statement just said that neither he nor the WH ordered it. — Jon Favreau (@jonfavs) March 4, 2017\n\nAnd Favreau endorsed a Twitter feed that laid out the reporting about the existence of the wiretaps, which cited reporting from Louise Mensch, formerly of Heat Street, and The Guardian that the Obama DOJ had sought a FISA court approved surveillance warrant for Trump Tower back in the summer of 2016 that was denied but received a narrower focused warrant in October.\n\nOk you definitely need to read this thread https://t.co/W7CkXjV40f — Jon Favreau (@jonfavs) March 4, 2017\n\n1/ The wiretaps that Donald Trump \"just found out\" about have been reported for weeks. I'm going to summarize here some of the discussion. — Justin Hendrix (@justinhendrix) March 4, 2017\n\n2/ @LouiseMensch broke the news for @heatstreet that a FISA warrant was granted to explore Donald's Russia Ties https://t.co/1q8cR58YO9 pic.twitter.com/ixedz3TuTx — Justin Hendrix (@justinhendrix) March 4, 2017\n\n3/ The @guardian's @julianborger reported on the FISA warrant again when the Steele dossier news broke in January https://t.co/CZKm9Tam7l pic.twitter.com/CX0PAGTDs7 — Justin Hendrix (@justinhendrix) March 4, 2017\n\n4/ Republicans who have defended surveillance powers are now critical of it especially following Flynn's resignation https://t.co/bRVcxF9jlF pic.twitter.com/PgYLhfj1bQ — Justin Hendrix (@justinhendrix) March 4, 2017\n\n5/ And just this week Donald's administration announced it had no intention of curtailing FISA https://t.co/5RPG2CP3j4 pic.twitter.com/jXGbWoUqJ2 — Justin Hendrix (@justinhendrix) March 4, 2017\n\n6/ When @LouiseMensch reported on the FISA tap, she included details that implicated Putin's own daughters, Carter Page and Paul Manafort. pic.twitter.com/TgeO9x1NvC — Justin Hendrix (@justinhendrix) March 4, 2017\n\n7/ This week @SenCoonsOffice suggested the transcripts that the FBI has may prove collusion with Russia. https://t.co/QIAustEs5C — Justin Hendrix (@justinhendrix) March 4, 2017\n\n8/ Coons has been one of the staunchest critics of surveillance powers, having introduced bills to reign in FISA https://t.co/iJGlzcPayg — Justin Hendrix (@justinhendrix) March 4, 2017\n\n9/ Back to Donald. Wiretapping him was not illegal, full stop. And it suggests the court had reason to permit it. https://t.co/RZrw5qmgyR — Justin Hendrix (@justinhendrix) March 4, 2017\n\n10/ Donald's tweets this morning are a helpful reminder that he was under investigation, possibly for espionage. https://t.co/C00LleeOIE — Justin Hendrix (@justinhendrix) March 4, 2017\n\n11/ We can now conclude that our govt has significant intelligence on Donald and his associates. We need to see it. https://t.co/QIm9WAvkzq — Justin Hendrix (@justinhendrix) March 4, 2017\n\n12/ Donald can whine about being surveilled, but the reality is we citizens must now demand a special prosecutor and a select committee. — Justin Hendrix (@justinhendrix) March 4, 2017\n\n13/ Interesting addendum- Donald's tweets this morning may have in fact declassified the existence of the wiretap https://t.co/pk4AdRyXLn — Justin Hendrix (@justinhendrix) March 4, 2017\n\nDavid Axelrod, another former Obama adviser, tweeted that such a wiretap would receive court approval “for a reason.”\n\nIf there were the wiretap @realDonaldTrump loudly alleges, such an extraordinary warrant would only have been OKed by a court for a reason. — David Axelrod (@davidaxelrod) March 4, 2017\n\nIn other words, these ex-Obama officials are subtly confirming the accuracy of the reporting—that the Obama administration did in fact conduct surveillance on Trump Tower in October and post-election, and that the administration originally sought a warrant back in the summer of 2016—but they say the president himself and the Obama White House was not involved in the decision.\n\nWhat’s more, Philip Rucker, the White House bureau chief at the Washington Post, says the same thing as these former Obama officials: That the Obama spokesman’s statement does not deny the existence of wiretaps on Trump Tower, only that Obama himself and the Obama White House did not approve them if they did exist.\n\nThe Obama statement does not say there was no federal wire tapping of Trump Tower. It only says Obama and White House didn’t order it. — Philip Rucker (@PhilipRucker) March 4, 2017\n\nThe outrage from the media and the Democrats appears to be standard hatred of Trump. The president forced a set of facts into the news cycle that was already previously public but framed in a way that puts his political opponents and the establishment media on the defensive. This appears to be the calculus: either the wiretaps exist, as Trump suggests, and the president will use them to bludgeon the Obama administration and the media for impropriety and overreach; or, there were no wiretaps, which suggests the previous administration had no reason to suspect Trump colluded with a foreign government.", "date": "2017-03-04 00:00:00", "title": "Non-Denial ‘Denial’: Obama Response to Trump ‘Wiretap’ Claim Raises More Questions"}
{"sourceurl": "http://www.breitbart.com/big-government/2017/03/04/chelsea-clinton-defends-kellyanne-conway-calls-rep-richmonds-joke-despicable/", "sourcename": "breitbart", "response_body": "SIGN UP FOR OUR NEWSLETTER\n\nChelsea Clinton defended White House adviser Kellyanne Conway after a Democratic congressman, Rep. Cedric Richmond, made a distasteful joke about Conway being on her knees in the Oval Office.\n\nClinton wrote on Twitter, “Despicable. I hope [Kellyanne Conway] receives the apology she deserves-certainly never thought I’d write that & I mean every word”:\n\nSIGN UP FOR OUR NEWSLETTER\n\nDespicable. I hope @KellyannePolls receives the apology she deserves-certainly never thought I'd write that & I mean every word. https://t.co/NmvFwNL21d — Chelsea Clinton (@ChelseaClinton) March 3, 2017\n\nConway thanked Clinton on Twitter after she expressed disappointment in the lack of “sisterhood” support over Richmond’s (D-LA) sexist comments about her:\n\nThank you, @ChelseaClinton. As strong women, as moms to Charlottes…appreciate you speaking out on this. https://t.co/rxBnXq553t — Kellyanne Conway (@KellyannePolls) March 3, 2017\n\n“Thank you, @ChelseaClinton. As strong women, as moms to Charlottes…appreciate you speaking out on this,” she said.\n\nClinton has become an unlikely Conway supporter, as she has mocked her and the Trump administration on Twitter in the past.\n\nDuring a speech at the Washington Press Club Foundation dinner Wednesday, Rep. Richmond said Conway “looked kind of familiar” kneeling on the Oval Office couch.\n\n“You even mentioned Kellyanne and that picture on that sofa,” Richmond said. “I really want to know what was going on there because she really looked kind of familiar in that position there, but don’t answer.”\n\nWhile Richmond said he was merely making a joke, his joke was not well-received by the crowd and on social media.\n\nConway called his joke “sexist and unfunny” while numerous others on social media, including Republican National Committee chair Ronna Romney McDaniel, condemned the congressman for his comments.", "date": "2017-03-04 00:00:00", "title": "Chelsea Clinton Defends Kellyanne Conway, Calls Rep. Cedric Richmond’s Joke ‘Despicable’"}
{"sourceurl": "http://www.breitbart.com/big-government/2017/03/04/christian-bakers-lost-everything-refusing-gay-wedding-cake-appeal-verdict/", "sourcename": "breitbart", "response_body": "SIGN UP FOR OUR NEWSLETTER\n\nAn Oregon couple fined $135,000 for refusing to make a cake for a lesbian wedding appeared before the Oregon Court of Appeals for the first time on Thursday, in an effort to have the judgment overturned.\n\nIn one of the most notorious religious liberty cases in recent years, Aaron and Melissa Klein, owners of Sweet Cakes by Melissa, were found guilty of discrimination in 2013 of for refusing to bake a wedding cake for a same-sex couple because it violated the tenets of their Christian faith.\n\nSIGN UP FOR OUR NEWSLETTER\n\nThe court sentenced the Christian couple to a fine of $135,000 for the “emotional damage” they had allegedly caused the lesbian pair. Rachel Cryer-Bowman and Laurel Bowman-Cryer had accused the Kleins of “mental rape,” adding that they had suffered a “loss of appetite” and “impaired digestion” from the ordeal, which remarkably led to simultaneous “weight gain.”\n\nIn 2015, Oregon Labor Commissioner Brad Avakian slapped a gag order on the Kleins, following the couple’s interview with Family Research Council’s Tony Perkins. During the interview, Aaron said among other things, “This fight is not over. We will continue to stand strong.”\n\n“The Commissioner of the Bureau of Labor and Industries hereby orders [Aaron and Melissa Klein] to cease and desist from publishing, circulating, issuing or displaying, or causing to be published … any communication to the effect that any of the accommodations … will be refused, withheld from or denied to, or that any discrimination be made against, any person on account of their sexual orientation,” Avakian wrote.\n\n“This effectively strips us of all our First Amendment rights,” wrote the Kleins on their Facebook page. “According to the state of Oregon we neither have freedom of religion or freedom of speech.”\n\n“We lost everything we loved and worked so hard to build,” she said.\n\nFrom the beginning, the Kleins have made it clear that they have never refused service to anyone based on sexual orientation, but their religious convictions did not permit them to participate in a gay wedding, which they believe to be immoral.\n\n“When we opened our bakery, we loved serving all customers who came into the shop, regardless of their identity or beliefs. My cakes were my canvas,” Melissa said. “My bakery wasn’t just called ‘Sweet Cakes Bakery,’ it was ‘Sweet Cakes by Melissa’ because I pour my passion and heart into each cake I make. My faith is a part of that.”\n\nAlthough the Kleins’ situation is bleak, shifting winds in Washington may give cause for a modicum of hope.\n\nThe Obama administration sent regular signals that religious liberty would be made to bow before lifestyle choices, but the Trump administration seems to be reversing previous White House hostility toward religious faith.\n\nIn late 2016, the Obama-appointed Chairman of the U.S. Commission on Civil Rights (USCCR) attacked proponents of religious liberty, suggesting that religion is simply a cover for bigotry, prejudice, and discrimination.\n\nMartin R. Castro stated that the phrases “religious liberty” and “religious freedom” are nothing more than “code words for discrimination, intolerance, racism, sexism, homophobia, Islamophobia or any form of intolerance.”\n\nAccording to Tim Schultz, the president of the 1st Amendment Partnership, the Obama administration seemed to view religion as an enemy standing in the way of their policy objectives.\n\n“They view religious freedom as a kind of inconvenient speed bump on the way to those objectives in some way,” Schultz said.\n\nThis has not been the tone taken by the new administration.\n\nIn his very first executive order after assuming office, President Trump sought to “ease the burden” of Obamacare by granting exemptions wherever possible to those unduly constrained by the law. Trump’s move followed a long and contentious battle between the Obama administration and the Little Sisters of the Poor, who were being coerced into providing services to which they morally objected.\n\nThis week, dozens of conservatives and faith-based groups signed a letter urging President Trump to sign an executive order to protect the religious liberty of people and organizations that have been harassed by the federal government for expressing their beliefs on traditional marriage, the sanctity of life from birth to natural death, and other moral issues.\n\nThe Oregon Court of Appeals is expected to issue an opinion on the case of the Christian bakers sometime in the next few months.\n\nFollow Thomas D. Williams on Twitter Follow @tdwilliamsrome", "date": "2017-03-04 00:00:00", "title": "Christian Bakers Refusing Gay Wedding Cake Appeal Guilty Verdict"}
{"sourceurl": "http://www.breitbart.com/big-government/2017/03/04/woman-88-talks-man-out-of-raping-her-by-saying-she-is-hiv-positive/", "sourcename": "breitbart", "response_body": "SIGN UP FOR OUR NEWSLETTER\n\nAn 88-year-old woman says she was able to talk her way out of being raped after she lied to her would-be attacker and said she was HIV-positive.\n\nHelen Reynolds was in her apartment in Parkesburg, Pennsylvania Feb. 17 when a man dressed as an apartment complex worker forced his way inside her home and bound her mouth and hands with duct tape, the Daily Mail reported.\n\nSIGN UP FOR OUR NEWSLETTER\n\n“He wrapped it all around my face and my nose and my eye glasses. He had a piece in my mouth,” Reynolds told WPVI.\n\nShe said he took $40 from her purse and was about to rape her when she struck up a conversation with the man.\n\nDespite having duct tape in her mouth, she was able to talk the man out of raping her.\n\n“I said to him, ‘Well it’s like this,'” Reynolds recalled. “‘You might as well know the truth.’ I said, ‘I have HIV and my husband died from it,’ which is a lie.”\n\nShe said as soon as she told him that he walked out of the bedroom.\n\n“That’s the comment that saved my life,” she said.\n\nNo suspects have been found yet in connection with the attack on Reynolds.\n\nAuthorities say there have been a string of home invasions in Chester County, including a one that left a 72-year-old woman assaulted, tied up, and locked in a closet for four days.\n\nPolice arrested a 17-year-old who had escaped from a nearby behavioral facility in that case.\n\nWhen WPVI asked Reynolds if she had anything to say to her attacker who’s still on the loose, she said she had “nothing good to say about him.”\n\n“I have nothing good to say about him. Nothing at all. Put him in jail, and leave the sucker there,” Reynolds said.", "date": "2017-03-04 00:00:00", "title": "Woman, 88, Talks Man Out of Raping Her by Saying She Is HIV-Positive"}
{"sourceurl": "http://www.breitbart.com/big-government/2017/03/02/george-w-bush-gushes-over-his-genuine-affection-for-michelle-obama/", "sourcename": "breitbart", "response_body": "SIGN UP FOR OUR NEWSLETTER\n\nIn an interview, former President George W. Bush gushed about how much “genuine” affection he has for former first lady Michelle Obama.\n\nDespite that her husband, Barack, spent eight years blaming every problem in America on President Bush, George W. says he really likes the former first lady.\n\nSIGN UP FOR OUR NEWSLETTER\n\n“She kind of likes my sense of humor. Anybody who likes my sense of humor, I immediately like,” Bush said in a recent interview published by People Magazine.\n\nThe 70-year-old ex-president commented on the numerous photos depicting himself and Obama in affectionate poses — especially of the pair’s meeting at the 2016 opening of the Smithsonian’s National Museum of African American History and Culture.\n\n“I can’t remember where else I’ve sat next to her, but I probably have a few wise cracks and she seemed to like it okay,” “W” said. “I needle her a little bit and around her, I’m fairly lighthearted. [The Obamas] are around serious people all the time and we just took to each other.”\n\nOf their meeting at the Smithsonian event, Bush said, “When I saw her, it was a genuine expression of affection.”\n\nMichelle Obama made herself infamous in 2008 when she exclaimed that for the fist time in her “adult life” she was “proud of the country” when her husband was elected to the White House.\n\nW concluded his remarks on Michelle and Barack by noting that he heard they may want to start “doing things for our troops.” He also said that it will “take them a while to find their footing” after leaving the White House.\n\nThe Texan may not have to worry over much about Michelle and Barack’s presidential “afterlife,” though. News broke this week that the former first couple had invited former presidential advisor Valerie Jarrett to live with them in their new Washington D.C. home (a report later denied) in order to gear up for a permanent political campaign aimed at undermining President Donald Trump’s presidency.\n\nFollow Warner Todd Huston on Twitter @warnerthuston or email the author at igcolonel@hotmail.com.", "date": "2017-03-02 00:00:00", "title": "George W. Bush Gushes Over His ‘Genuine’ Affection for Michelle Obama"}
{"sourceurl": "http://www.breitbart.com/big-government/2017/03/02/report-valerie-jarrett-mount-insurgency-obamas-dc-mansion/", "sourcename": "breitbart", "response_body": "SIGN UP FOR OUR NEWSLETTER\n\nThe Daily Mail reports Valerie Jarrett has moved into the new Washington, D.C. mansion of former President Barack Obama, from which she will mount an insurgency against President Donald Trump.\n\nAccording to the report, Jarrett, Obama’s former special advisor in the White House, has moved into the home with former first lady Michelle Obama. The mansion, in the exclusive Kaloroma section of the nation’s capital, is alleged to serve as “the nerve center of a mounting insurgency against [Obama’s] successor, President Donald J. Trump.”\n\nSIGN UP FOR OUR NEWSLETTER\n\nThe plan, reportedly, is for Obama to force Trump to resign or to have him impeached.\n\nThe Daily Mail states that “a close Obama family friend” reported Jarrett and Michelle Obama have moved into Obama’s 8,200 square-foot home, which Obama is renting from Joe Lockhart, former President Bill Clinton’s press secretary.\n\n“There was never any doubt that Valerie would have a suite of rooms in the house that the Obama’s are renting,” the family friend reportedly said. “Obama trusts her judgment more than any other person on the planet, as does Michelle. Obama doesn’t make a decision without her.”\n\nThe report continues:\n\nThe former president has set up an office on the West End of the national’s capitol, where he recently hosted an open house for his White House staff – including Joe Biden, Susan Rice, Josh Earnest and Jarrett. But the office, part of his post presidency perks, cannot be used for political purposes. The rent on his home is paid by him personally. On Tuesday, former Attorney General Eric Holder revealed that Obama is indeed getting closer to making his public reappearance in politics. “It’s coming. He’s coming,” Holder said speaking to reporters. “And he’s ready to roll.”\n\n“No longer the most powerful man in the world, he was just observing Trump and not liking what he saw,” the source reportedly said. “He was weary and burned out after eight years in office. But Valerie convinced him that he didn’t have any choice if he wanted to save his legacy. And, as usual, he bowed to Valerie’s political wisdom and advice.”\n\nObama recently made one public comment in support of the protests against Trump’s executive order on immigration.\n\n“He is going to use his immense popularity with the half of the country that identifies as liberals and progressives,” the Obama family source reportedly said. “Millions of Americans are energized and ready to take to the streets to oppose Trump, but they need to be organized and have their anger focused and directed.”\n\n“Obama is dismayed at the way Trump is tearing down his legacy — ObamaCare, the social safety net and the welcome mat for refugees he put in place,” the source reportedly added.\n\nRight Scoop comments on the story: “It’s one thing to criticize Trump. But to mount an insurgency against him with the goal of him resigning or getting him impeached?”", "date": "2017-03-02 00:00:00", "title": "Report: Valerie Jarrett to Mount Insurgency from Obama’s DC Mansion"}
