{"sourceurl": "http://www.huffingtonpost.com/entry/obama-profiles-in-courage-award_us_58b84425e4b01fc1bde67bf1?section=us_politics", "sourcename": "huffpost", "response_body": "Former U.S. President Barack Obama on Thursday was named this year’s winner of the John F. Kennedy Presidential Library’s “Profile in Courage” award, an annual honor for leaders who stand up to political opponents.\n\nThe museum cited Obama’s signature healthcare reform law, which his successor President Donald Trump has vowed to repeal and replace, restored diplomatic ties with Cuba and the Paris climate change deal as key reasons for his selection.\n\n“President Obama has embodied the definition of courage that my grandfather cites in the opening lines of ‘Profiles in Courage’: grace under pressure,” Jack Schlossberg, the slain U.S. president’s grandson, said in a statement. “Throughout his two terms in office, he represented all Americans with decency, integrity, and an unshakeable commitment to the greater good.”\n\nThe award takes its name from Kennedy’s 1957 Pulitzer Prize-winning book about eight U.S. Senators who took principled stands on unpopular issues.\n\nPrevious winners include former presidents Gerald Ford and George H.W. Bush; Gabrielle Giffords, the former U.S. representative who left Congress after a gunman shot her in the head; and John McCain, the U.S. senator and former prisoner of war.\n\nObama will receive the award in a May 7 ceremony at the waterfront Boston Kennedy library.", "date": "2017-03-02 11:15:03", "title": "Kennedy Library Picks Obama For 'Profiles In Courage' Award"}
{"sourceurl": "http://www.huffingtonpost.com/entry/interior-secretary-zinke-arrives-on-horse_us_58b83f61e4b01fc1bde67495?section=us_politics", "sourcename": "huffpost", "response_body": "WASHINGTON — Ryan Zinke opted for a Montanan’s entrance for his first day on the job: The new interior secretary arrived at Interior Department headquarters on Thursday wearing a cowboy hat and riding a horse.\n\nThe agency’s Bureau of Safety and Environmental Enforcement shared a photo of the arrival, along with the message, “Let’s get to work!”\n\nBSEE is pleased to welcome the new Department of the Interior Secretary Ryan Zinke. \"Lets get to work!\" pic.twitter.com/520TMPxslr — BSEE (@BSEEgov) March 2, 2017\n\nThe horse, named Tonto, belongs to the United States Park Police and is kept in stables at the National Mall, according to The New York Times.\n\nDonald Trump nominated Zinke, a fifth-generation Montanan and former Navy SEAL, in December. The Senate confirmed him in a 68-31 vote, and he was sworn in as the 52nd interior secretary on Wednesday evening.\n\nZinke is tasked with overseeing an agency that has more than 70,000 employees and controls 500 million acres of land, including 59 national parks.\n\nIn a statement Wednesday, Zinke said he “honored and humbled” to serve.", "date": "2017-03-02 12:38:42", "title": "Trump's Interior Secretary Shows Up To New Post On Horseback"}
{"sourceurl": "http://www.huffingtonpost.com/topic/heroin-epidemic", "sourcename": "huffpost", "response_body": "The Morning Email helps you start your workday with everything you need to know: breaking news, entertainment and a dash of fun. Learn more", "date": null, "title": "Heroin Epidemic"}
{"sourceurl": "http://www.huffingtonpost.com/entry/black-activists-trump-protests_us_58b843fae4b02a4e8ddae6ee?section=us_politics", "sourcename": "huffpost", "response_body": "WASHINGTON ― The election of President Donald Trump has galvanized a number of new protesters who likely wouldn’t be involved in politics aside from voting every four years. Millions of people across the country attended women’s marches after Trump’s inauguration, and protests on the local level have continued to grow as citizens fight for issues that matter most to them.\n\nBut this wave of anti-Trump protests has a recent predecessor: the Movement for Black Lives, a coalition of activist groups seeking to improve the lives of black Americans.\n\nActivists involved in nationwide protests against police violence and systemic anti-black racism have remained a fixture in the media since the 2014 death of 18-year-old Michael Brown. Citizens in Ferguson, Missouri, where Brown was shot and killed by a white police officer, took the streets to voice their frustrations with a rigged municipal court system and the way Ferguson’s largely white police force treated the predominantly black city.\n\nMedia coverage of the strained relationships between police and the communities they serve grew as other cities ― including Chicago, Baltimore, Cleveland, Minneapolis and Charlotte, North Carolina ― were rocked by large-scale protests following deaths widely perceived as unjustified.\n\nAs one activist explains, protest movements like Black Lives Matter and the struggle for civil rights helped lay the foundation for the mobilization we’re seeing now. The Huffington Post spoke with six black activists to find out how they see activism evolving under the Trump administration, what advice they have for new protesters and more.\n\nA medley of their thoughts, edited for length and clarity, follows below.\n\nElijah Nouvelage/Reuters Amanda Ashe of Oakland raises her hands as a police helicopter circles overhead during demonstrations in Emeryville, California, after a grand jury decided there would be no charges in Michael Brown's death in November 2014.\n\nHow do you think activism will change now that Republicans are in power?\n\n“It is not just Anti-Trump but a firm resistance to what he represents. The very communities ― black, indigenous, Muslims, women, LBGTQ to name a few ― he attacked in his campaign, are now emboldened to stand up and say ‘Hell no! We will not allow hate and fear to rob us of our identity or our way of life.’”\n\n― Mike Lowe, a Black Lives Matter activist in San Antonio\n\n“More people will step into the role of activist because many individuals are afraid of the certainty of our country. You will also see an increase in police presence and possible martial law. Today, when we did a rally, they had helicopters hovering over us. Law enforcement is taking more precautions to intimidate, and also protect, citizens.”\n\n― P. Moses, an organizer with Black Lives Matter Memphis\n\n“Trump’s administration represents a Republican Party without morals, concern for law and an entire platform of extreme prejudice. This is an entirely new fight with old systems. Organizing around this type of overt hate, and increased autonomy for police and security forces, means that organizers across movement spectrums must find each other. We cannot organize in silos, or we will be out-organized by white supremacy.”\n\n— Janaya Khan, an organizer with Black Lives Matter Toronto\n\n“Trump’s commitment to more ‘law and order,’ less diversity and a rollback of fundamental human rights will galvanize a new cadre of activists and organizers ― people who didn’t see their struggle as intertwined with others’ until this devastating political moment. For them, there is an already existing network of coalitions and organizations ready to give them marching orders.”\n\n— Shanelle Matthews, director of communication for Black Lives Matter Global Network\n\n“The rhetoric of Trump’s administration has sparked a lot of new anger, which I hope encourages even more people to become active in advocating for ALL oppressed people in our society. I hope that more people begin to recognize that our society and country can not ever become great until people are as upset about the banning of ‘immigrants’ and attacks on the black community as they are upset about Hillary Clinton losing the election.”\n\n— Kwame Rose, an activist in Baltimore\n\n“Tactics will intensify and increase as the violence against black folks, Muslims and LGBTQ folks intensifies. I also think that Movement for Black Lives organizers will continue to get more strategic around direct action tactics as well as messaging.”\n\n— Ashley Williams, an organizer with Charlotte Uprising\n\nMichael Nigro/Pacific Press/LightRocket via Getty Images Protesters took to the streets of downtown Cleveland the day after the local grand jury decided not to indict the officers who shot and killed 12-year old Tamir Rice.\n\nWhat do you make of the protests that have happened so far, like the airport protests and women’s marches?\n\n“I can see the beauty of solidarity and what can happen when people come together, but I caution anyone who would erase the work of fearless black women who have been the face of much of the unapologetic resistance and demand for change we see today. It is these black women whom we should listen to and learn from as we move forward.” ― Lowe\n\n“They act as a moral compass for the country. They are uplifting. However, it is going to take much more than mobilization to win this fight. We have the incredible task of using 20th-century models of resistance while also creating 21st-century ones that accurately reflect the times we are in. Organizing across movements, the development of networks and information-sharing between groups are central to winning this in the long haul.” — Khan\n\n“We need more than marches and protests. We need real political power. While protests and marches have their place in the movement, we need to build and consolidate power to ensure lawmakers committed to true democracy and equitable treatment under the law for all people are encouraged to run and are elected.” — Matthews\n\n“They’ve been great depictions of solidarity. These acts of resistance can’t stop with airport protests. Furthermore, we need thousands of people to start showing up when black people are killed by police in the same numbers that folks are showing up at these airport protests. I would also hope that folks practice deep solidarity with folks in their communities across political lines if possible.” — Williams\n\nPatrick Smith/Getty Images A man celebrates in the street after Marilyn Mosby, state's attorney for Baltimore, ruled the death of Freddie Gray a homicide and announced that criminal charges would be filed.\n\nWhat lessons do you think those currently protesting Trump will take away?\n\n“We must recognize there is no limit to what white supremacy will do to ensure it protects itself. We must find a way to abolish the systems that oppress those groups [that] are the most vulnerable ... and implement them now to avoid the next issue.” ― Lowe\n\n“They are learning that democracy comes with a price and that it is something that every American should value. It will resonate with those who have taken freedom and beliefs for granted and those who want our country to remain civil and free. They will contribute any amount of support to all causes that they feel will affect them personally, socially and professionally.” ― Moses\n\n“Tactics like protest and organizing are critical to ensuring a fair democracy for all people. My assumption is that soon we will commit to an increasingly more layered strategy that incorporates a proactive approach to movement and power building. For those who are newly organized and activated, they may walk away from protest feeling eager to find new ways to engage in dissent and demand real democracy. When they do, Black Lives Matter will be ready to receive them.” — Matthews\n\n“When you cause disruption, you force people to pay attention ― and all around the world, people saw the actions of protesters in a nonviolent manner which encouraged people to join those safe spaces. The #NoBanNoWall movement has seen large numbers of protesters because of #BlackLivesMatter protesters displaying nonviolent civil disobedience, and the next movement after this one will be even bigger. As a society, we are learning how to listen to those affected by racism, homophobia and hatred. The more we listen, the more we learn, the more we are inspired to put an end to it.” — Rose\n\n“Every executive order not only harms the explicit targeted group, but it harms everyone. When Muslim folks are targeted in my community, it impacts all of us. When Latinx folks are deported from my community, it impacts all of us. When Black people are killed by police, it impacts all of us. When trans women are brutalized in the street, it impacts all of us.” — Williams\n\nJason Miczek/Reuters People rally outside of Bank of America stadium during an NFL game to protest the police shooting of Keith Scott in Charlotte, North Carolina.\n\nWhat advice do you have for activists opposing the Trump administration?\n\n\n\n“There is no platform too small to use for your voice to be heard. There are many who have done the work before us. Their work should be studied and applied as necessary to the work we are doing now. We must act. Our action should lead to mobilizing, and mobilizing must lead to change ― a change that places individuals back in power who look like us and value what we need changed and protected the most.” ― Lowe\n\n“Expect the unexpected, and [don’t] be surprised by anything that happens. For example, Trump signed an order banning Muslims in America, the land of the free, home of the brave. That seems unreal, but it happened. The best way to prepare for Trump is to be organized and dedicated to resistance, because that is the only thing that will allow us to maintain a good grip on society.” ― Moses\n\n“Activists need to plan around the reality of protest fatigue. Protest fatigue sets in quickly when numbers dwindle and ‘wins’ are not immediate. Looking at sustainable practices and organizing over mobilizing will be incredibly important. As an activist, it’s important to remember when there is much you don’t know, fall back on what you do.” — Khan\n\n“Create narratives that speak to shared values, are clear about the problem and solution, and that speak to specific audiences ― audiences we’ve long written off as too uneducated and too unwilling to change. Audiences who share a difference of opinion or political belief. Audiences who, before Nov. 8, we thought had too little power to make any real change. Audiences we underestimated and ignored and now must prioritize.” — Matthews\n\n“Utilize [your] First Amendment rights to the extreme extent allowed by law, and [don’t] be afraid. The ACLU has done a tremendous job at protecting protesters over the years, and we should continue to support and utilize the resources that we have to further the fight for equity in this country.” — Rose\n\n“Rely on the experience and knowledge of folks who have been organizing. The Movement for Black Lives, as well as the civil rights movement, helped to lay the foundation for the kind of resistance that we see today. Folks should continue centering those who are most impacted. This isn’t the time to re-invent the wheel. This is the time to analyze past tactics, decide on the ones that will help us win, and move forward with those.” — Williams", "date": "2017-03-02 13:17:03", "title": "Black Activists Have Some Advice For New Protesters Pushing Back Against Donald Trump"}
{"sourceurl": "http://www.huffingtonpost.com/entry/richard-painter-jeff-sessions-russia_us_58b7d1afe4b0a8ded67a525d?section=us_politics", "sourcename": "huffpost", "response_body": "A law professor who served as the White House ethics lawyer under former President George W. Bush slammed Attorney General Jeff Sessions over reports that he lied to Congress about his communications with Russia.\n\nAccording to the The Washington Post, Sessions spoke to the Russian ambassador twice last year and did not mention the conversations in his confirmation hearings.\n\nIf the report is true, it’s “a good way to go to jail,” said Richard Painter, who served as White House ethics lawyer between 2005 and 2007 and is now law professor for the University of Minnesota.\n\nMisleading the Senate in sworn testimony about one own contacts with the Russians is a good way to go to jail https://t.co/qH0s6sTMJ9 — Richard W. Painter (@RWPUSA) March 2, 2017\n\nI spent two hours with the Congressional Black Caucus today discussing Russian attacks on the US. Does AG Sessions have anything to say? — Richard W. Painter (@RWPUSA) March 2, 2017\n\nSessions on Wednesday denied he had any contact with Russia about the 2016 presidential campaign.\n\nEarlier on Wednesday, The New York Times reported that White House officials under former President Barack Obama subtly tipped off intelligence agencies about their concerns about Trump’s ties to Russia.", "date": "2017-03-02 04:36:18", "title": "Bush's Ethics Lawyer: Jeff Sessions May Go To Jail If He Lied To Congress"}